tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Search tool like grep, but optimized for programmers
brew "ack"
# Command-line interface for SQLite
brew "sqlite"
# Official Amazon AWS command-line interface
brew "awscli"
# Core application library for C
brew "glib"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tool for exploring each layer in a docker image
brew "dive"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Postgres C API library
brew "libpq"
# Apache Kafka C/C++ library
brew "librdkafka"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Manage multiple Node.js versions
brew "nvm"
# General-purpose scripting language
brew "php"
# Object-relational database system
brew "postgresql"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Embeddable, persistent key-value store for fast storage
brew "rocksdb"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Tool to build, change, and version infrastructure
brew "terraform"
# Framework for scalable cross-language services development
brew "thrift"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Truncates a file to a given size
brew "truncate"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
cask "adoptopenjdk/openjdk/adoptopenjdk12"
cask "kap"
